 ALLOCATE F(SYSIN) DA(*)
 ALLOCATE F(SYSOUT) DA(*)
 DSN SYSTEM(DSN)
   RUN PROGRAM(P010)  -
       PLAN(PYRLPLN)  -
       LIBRARY('MM01.DB2.LOADLIB')
   END
 FREE F(SYSIN)
 FREE F(SYSOUT)
